
[
  {
    "id": "vernato",
    "name": "Vernato",
    "tagline": "AI-Powered Pronunciation Coach",
    "description": "Vernato is an AI-powered pronunciation improvement platform helping learners speak with clarity and confidence. Our PronScore™ model combines accuracy, fluency, and completeness into a single score, giving users actionable feedback that actually drives progress. Built at the intersection of language learning and technology, Vernato is designed for individuals, educators, and organizations seeking a smarter way to master spoken language. We’re on a mission to make effective pronunciation training accessible, measurable, and engaging worldwide.",
    "keyFeatures": [
      "PronScore™ model for comprehensive feedback",
      "Actionable insights on accuracy, fluency, and completeness",
      "Designed for individuals, educators, and organizations",
      "Engaging and measurable pronunciation training"
    ],
    "techStack": "React, Python, Google Cloud, Firebase",
    "outcomes": "Successfully developed and deployed a an AI model for pronunciation scoring. The platform is currently in beta with a select group of users, gathering feedback to refine the learning experience and prepare for a public launch.",
    "repoUrl": null,
    "demoUrl": "https://www.vernato.org",
    "images": ["vernato-1"],
    "startDate": "2025-06-01",
    "endDate": null,
    "type": "project",
     "theme": {
      "primary": "hsl(196, 75%, 52%)",
      "secondary": "hsl(45, 100%, 55%)"
    }
  },
  {
    "id": "simplify-me",
    "name": "Simplify Me.",
    "tagline": "Understand Terms of Service in Plain English.",
    "description": "You know when you sign up for a new website or download a shiny new app, and you’re hit with a wall of text that seems to go on forever? Yeah, that’s the Terms of Service. It’s like reading a novel written in legal jargon, and honestly, who has time for that? Our mission is simple: to help you make informed decisions about your privacy. We’ll give you the key details you need to know, like what data is being collected, how it’s used, and who it’s shared with. Please be informed that we are based on the ToS;DR infrastructure and it abides their Terms of Service. Go check it out for yourself. Trust us, it ain’t too long.",
    "keyFeatures": [
      "Translates complex legal jargon into plain English",
      "Summarizes key data collection and privacy policies",
      "Highlights how your data is used and shared",
      "Powered by the ToS;DR community-driven infrastructure"
    ],
    "techStack": "ToS;DR API, Next.js, TypeScript, Tailwind CSS, AWS",
    "outcomes": "Empowered thousands of users to make more informed decisions about their digital privacy. The project has been recognized for its user-centric approach to data transparency and has contributed to the broader conversation about online privacy rights.",
    "repoUrl": null,
    "demoUrl": "https://www.simplifyme.org",
    "images": ["simplify-me-1"],
    "startDate": "2023-01-01",
    "endDate": "2025-05-01",
    "type": "project",
    "theme": {
      "primary": "hsl(267, 95%, 48%)",
      "secondary": "hsl(14, 99%, 57%)"
    }
  },
  {
    "id": "simply",
    "name": "Simply",
    "tagline": "AI Discord Bot for Decoding Privacy Policies & ToS",
    "description": "Simply is an advanced Discord AI bot designed to decode the complexities of Privacy Policies and Terms of Service. Leveraging the power of Google Gemini, Simply streamlines the interpretation of legal documents by providing precise and easily understandable summaries. This project is a core component of the Simplify Me. ecosystem. Although the bot is no longer active on Discord, its powerful summarization engine can be accessed at www.simplifyme.org. *Credit for the foundational codebase goes to Echoshard on GitHub (github.com/Echoshard/Gemini_Discordbot).*",
    "keyFeatures": [
      "Multi-Format Support: Processes various file types, including images, PDFs, and text files.",
      "Contextual Analysis: Maintains a history window of up to 15 previous messages for coherent conversations.",
      "Privacy Control: Users can reset and clear their message history at any time.",
      "Performance and Scalability: Runs on Python in an Amazon EC2 instance for reliable performance.",
      "High-Accuracy Summaries: Extensively trained on legal texts to handle documents up to 70,000 words."
    ],
    "techStack": "Python, AWS EC2, Google Gemini, Discord API",
    "outcomes": "Successfully developed and deployed a Discord bot capable of simplifying complex legal documents, demonstrating skills in AI integration, API usage, and cloud deployment. The technology now powers the core summarization features of the Simplify Me. web platform.",
    "repoUrl": "https://github.com/Echoshard/Gemini_Discordbot",
    "demoUrl": "https://www.simplifyme.org",
    "images": ["simply-1"],
    "startDate": "2023-08-01",
    "endDate": "2024-07-01",
    "type": "project",
    "theme": {
      "primary": "hsl(221, 83%, 53%)",
      "secondary": "hsl(210, 40%, 96.1%)"
    }
  },
  {
    "id": "emty",
    "name": "EMTY",
    "tagline": "Real-time Transit Data Prototype",
    "description": "EMTY is a high-fidelity prototype designed to visualize real-time transit data from the MTA API. The prototype was built using a combination of design and database tools to simulate a live data environment. It demonstrates a concept for an intuitive user interface for tracking and understanding public transportation movements.",
    "keyFeatures": [
      "Live visualization of transit data on an interactive map",
      "User-friendly interface for tracking and filtering routes",
      "Built with a focus on design and data simulation"
    ],
    "techStack": "Figma, Canva, Firestore, Firebase Realtime Database, MTA API",
    "outcomes": "Successfully created a proof-of-concept that demonstrates the feasibility of a live transit tracking application. The prototype was used to secure stakeholder buy-in for a full-scale development project. The design was praised for its clarity and user-centric approach.",
    "repoUrl": null,
    "demoUrl": "https://linktr.ee/emty7",
    "images": ["emty-1"],
    "startDate": "2024-08-01",
    "endDate": "2025-04-01",
    "type": "project",
     "theme": {
      "primary": "hsl(210, 40%, 50%)",
      "secondary": "hsl(160, 60%, 45%)"
    }
  }
]
