
[
  {
    "id": "vernato",
    "name": "Vernato",
    "tagline": "AI-Powered Pronunciation Platform",
    "description": "Vernato is an AI-powered pronunciation improvement platform helping learners speak with clarity and confidence. Our PronScore™ model combines accuracy, fluency, and completeness into a single score, giving users actionable feedback that actually drives progress.\nBuilt at the intersection of language learning and technology, Vernato is designed for individuals, educators, and organizations seeking a smarter way to master spoken language. We’re on a mission to make effective pronunciation training accessible, measurable, and engaging worldwide.",
    "keyFeatures": [
      "PronScore™ model for comprehensive feedback",
      "Actionable insights on accuracy, fluency, and completeness",
      "Designed for individuals, educators, and organizations",
      "Engaging and measurable pronunciation training"
    ],
    "techStack": "TypeScript, React, Next.js, Azure, Google Cloud, Firebase, Vercel, Tailwind CSS, Git",
    "keywords": ["AI & Machine Learning", "Web Development", "Creative Tech"],
    "outcomes": "Successfully developed and deployed a an AI model for pronunciation scoring.\nThe platform is currently in beta with a select group of users, gathering feedback to refine the learning experience and prepare for a public launch.",
    "repoUrl": null,
    "demoUrl": "https://www.vernato.org",
    "images": ["vernato-1"],
    "startDate": "2025-06-01",
    "endDate": null,
    "type": "project",
     "theme": {
      "primary": "hsl(196, 75%, 52%)",
      "secondary": "hsl(45, 100%, 55%)"
    }
  },
  {
    "id": "emty",
    "name": "EMTY Commuting App",
    "tagline": "Real-Time Subway Occupancy Data",
    "description": "As part of the Entrepreneurship and App Design course at the STEM Institute at City College of New York, I designed an app named EMTY for NYC’s Department of Transportation. EMTY provides real-time data on individual subway car passenger loads, helping to improve commuter flow and convenience. I plan to pitch EMTY to Rep. Espaillat as part of the 2025 Congressional App Challenge.",
    "keyFeatures": [
      "Live visualization of subway car occupancy data",
      "Designed UX in Figma for intuitive data display",
      "Secure real-time backend with Firebase",
      "Pitched to the U.S. Capitol and Congressman's office"
    ],
    "techStack": "Figma, Canva, Firebase, MTA API",
    "keywords": ["UI/UX & Design"],
    "outcomes": "I earned a Gold Award in this course for our research poster, which highlighted how real-time data on passenger loads and waiting times can enhance the commuting experience. For more details on EMTY, visit linktr.ee/emty7.",
    "repoUrl": null,
    "demoUrl": "https://linktr.ee/emty7",
    "images": ["emty-1"],
    "startDate": "2024-08-01",
    "endDate": "2025-04-01",
    "type": "project",
     "theme": {
      "primary": "hsl(210, 40%, 50%)",
      "secondary": "hsl(160, 60%, 45%)"
    }
  },
  {
    "id": "simplify-me",
    "name": "Simplify Me.",
    "tagline": "Understand Terms of Service in Plain English.",
    "description": "You know when you sign up for a new website or download a shiny new app, and you’re hit with a wall of text that seems to go on for ever? Yeah, that’s the Terms of Service. It’s like reading a novel written in legal jargon, and honestly, who has time for that?\nOur mission is simple: to help you make informed decisions about your privacy. We’ll give you the key details you need to know, like what data is being collected, how it’s used, and who it’s shared with. Please be informed that we are based on the ToS;DR infrastructure and it abides their Terms of Service. Go check it out for yourself. Trust us, it ain’t too long.",
    "keyFeatures": [
      "Translates complex legal jargon into plain English",
      "Summarizes key data collection and privacy policies",
      "Highlights how your data is used and shared",
      "Powered by the ToS;DR community-driven infrastructure"
    ],
    "techStack": "JavaScript, PHP, WordPress, Zapier, Google Gemini, CSS, HTML",
    "keywords": ["AI & Machine Learning", "Web Development", "Creative Tech"],
    "outcomes": "Empowered thousands of users to make more informed decisions about their digital privacy.\nThe project has been recognized for its user-centric approach to data transparency and has contributed to the broader conversation about online privacy rights.",
    "repoUrl": null,
    "demoUrl": "https://simplifyme.org",
    "images": ["simplify-me-1"],
    "startDate": "2023-01-01",
    "endDate": "2025-05-01",
    "type": "project",
    "theme": {
      "primary": "hsl(267, 95%, 48%)",
      "secondary": "hsl(14, 99%, 57%)"
    }
  },
  {
    "id": "simply",
    "name": "Simply",
    "tagline": "Discord Bot for Decoding Legalese",
    "description": "Simply is an advanced Discord AI bot designed to decode the complexities of Privacy Policies and Terms of Service. Leveraging the power of Google Gemini, Simply streamlines the interpretation of legal documents by providing precise and easily understandable summaries.\nThis project is a core component of the Simplify Me. ecosystem. Although the bot is no longer active on Discord, its powerful summarization engine can be accessed at simplifyme.org. *Credit for the foundational codebase goes to Echoshard on GitHub (github.com/Echoshard/Gemini_Discordbot).*",
    "keyFeatures": [
      "Multi-Format Support: Processes various file types, including images, PDFs, and text files.",
      "Contextual Analysis: Maintains a history window of up to 15 previous messages for coherent conversations.",
      "Privacy Control: Users can reset and clear their message history at any time.",
      "Performance and Scalability: Runs on Python in an Amazon EC2 instance for reliable performance.",
      "High-Accuracy Summaries: Extensively trained on legal texts to handle documents up to 70,000 words."
    ],
    "techStack": "Python, AWS, Google Gemini, Discord API",
    "keywords": ["AI & Machine Learning", "Creative Tech"],
    "outcomes": "Successfully developed and deployed a Discord bot capable of simplifying complex legal documents, demonstrating skills in AI integration, API usage, and cloud deployment.\nThe technology now powers the core summarization features of the Simplify Me. web platform.",
    "repoUrl": "https://github.com/aarushkmalhotra/Simply",
    "demoUrl": "https://simplifyme.org",
    "images": ["simply-1"],
    "startDate": "2023-08-01",
    "endDate": "2024-07-01",
    "type": "project",
    "theme": {
      "primary": "hsl(221, 83%, 53%)",
      "secondary": "hsl(210, 40%, 96.1%)"
    }
  },
  {
    "id": "youtube-thumbnails",
    "name": "YouTube Thumbnails",
    "tagline": "Graphic Design for Digital Content",
    "description": "Beyond coding, I have a passion for visual storytelling and graphic design. I create all the thumbnails for my <a href=\"https://www.youtube.com/@sunbeam20/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"underline\">YouTube channel, sunbeam</a>, using a combination of Adobe Photoshop, Illustrator, and GIMP. This process involves everything from concept sketching and asset creation to color grading and typographic design, all aimed at creating engaging and click-worthy visuals that capture the essence of each video.",
    "keyFeatures": [
      "Conceptualization and sketching of thumbnail ideas.",
      "Advanced photo manipulation and compositing in Photoshop.",
      "Vector asset creation with Illustrator and GIMP.",
      "Typography and color theory to maximize click-through rate.",
      "Consistent branding across channel content."
    ],
    "techStack": "Adobe Photoshop, Adobe Illustrator, GIMP",
    "keywords": ["UI/UX & Design", "Creative Tech"],
    "outcomes": "Developed a strong portfolio of eye-catching thumbnails that have improved viewer engagement and channel growth. This creative outlet hones my skills in visual communication, branding, and user psychology, complementing my technical work as a developer.",
    "repoUrl": null,
    "demoUrl": "https://www.youtube.com/@sunbeam20/",
    "images": ["yt-thumb-2", "yt-thumb-4", "yt-thumb-1", "yt-thumb-3"],
    "startDate": "2022-09-01",
    "endDate": "2023-08-01",
    "type": "project",
    "theme": {
      "primary": "hsl(0, 100%, 50%)",
      "secondary": "hsl(0, 0%, 13%)"
    }
  },
  {
    "id": "rvc-ui",
    "name": "RVC UI & Songs",
    "tagline": "Voice Transformation for Songs",
    "description": "Retrieval Based Voice Conversion (RVC) is a technique used in speech processing where a system learns to transform one speaker's voice into another's by retrieving similar-sounding samples from a large database.\nAfter seeing AI-generated songs and covers gaining popularity on social media, I embarked on an exciting journey to create samples where the renowned Hindi singer Arijit Singh could sing various songs beyond his originals. To achieve this, I leveraged preexisting datasets trained between 1200–2000 epochs. This entire project was run locally on my Windows machine using Python and its powerful libraries. Additionally, I trained the model with a dataset of my own voice to better understand the challenges of RVC and dataset creation.",
    "keyFeatures": [
      "Utilized Retrieval-Based Voice Conversion (RVC) for voice transformation.",
      "Leveraged pre-trained models to generate AI song covers.",
      "Created a custom voice dataset to experiment with model training.",
      "Hands-on experience with local AI model implementation."
    ],
    "techStack": "PyTorch, Gradio, Python, CUDA",
    "keywords": ["AI & Machine Learning", "Creative Tech"],
    "outcomes": "Successfully produced high-quality AI-generated song samples, demonstrating a practical understanding of voice conversion technologies.\nThis project provided deep insights into the nuances of AI model training, dataset management, and the creative potential of generative AI in music.",
    "repoUrl": null,
    "demoUrl": null,
    "images": ["rvc-1"],
    "startDate": "2023-07-01",
    "endDate": "2024-01-01",
    "type": "project",
    "theme": {
      "primary": "hsl(330, 80%, 55%)",
      "secondary": "hsl(20, 80%, 55%)"
    },
    "audioFiles": [
      {
        "id": "yetu-ne-kya-kiya",
        "title": "Ye Tune Kya Kiya - AI Cover",
        "file": "/arijit_1000_yetunekyakiya.mp3",
        "originalArtist": "Javed Bashir",
        "originalComposer": "Pritam",
        "originalLyricist": "Rajat Arora",
        "originalLabel": "T-Series"
      },
      {
        "id": "ajab-si",
        "title": "Ajab Si - AI Cover",
        "file": "/arijit_1100_ajabsi.mp3",
        "originalArtist": "KK",
        "originalComposer": "Vishal-Shekhar",
        "originalLyricist": "Vishal Dadlani",
        "originalLabel": "T-Series"
      }
    ]
  },
  {
    "id": "cifar-10-cnn",
    "name": "CIFAR-10 CNN",
    "tagline": "Object Classification Model",
    "description": "As an AI Scholar at Veritas AI, I led the development of our group's capstone project. We used the CIFAR-10 dataset for object and image detection by building and customizing a convolutional neural network (CNN).\nThis project was completed under the expert mentorship of <a href=\"https://www.linkedin.com/in/jasonjabbourj/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"underline\">Jason Jabour</a>, a Computer Science PhD candidate at Harvard University.",
    "keyFeatures": [
      "Custom Convolutional Neural Network (CNN) architecture",
      "Trained on the CIFAR-10 dataset for object recognition",
      "Led a group capstone project as a Veritas AI Scholar",
      "Mentored by a Harvard PhD candidate in Computer Science"
    ],
    "techStack": "Python, PyTorch, CNN, Deep Learning",
    "keywords": ["AI & Machine Learning"],
    "outcomes": "Developed a high-accuracy object classification model and presented the findings, methodology, and results in a comprehensive presentation.",
    "repoUrl": null,
    "demoUrl": "https://docs.google.com/presentation/d/1SxtFXwkSP7j3ouTHC2i0pD7lLCfUJtWJVXgNG7_GLuo/",
    "images": [
      "cifar-1"
    ],
    "startDate": "2024-09-01",
    "endDate": "2024-11-01",
    "type": "project",
    "theme": {
      "primary": "hsl(204, 86%, 53%)",
      "secondary": "hsl(348, 100%, 61%)"
    }
  },
   {
    "id": "imdb-top-1000",
    "name": "IMDB Top 1000",
    "tagline": "My First JavaScript Project",
    "description": "This was my first dive into vanilla JavaScript on Code.org's App Lab, and served as my final project for AP Computer Science Principles. This app lets users browse and search the top 1000 IMDB movies, serving as a practical exercise in data handling and UI development. It represents a foundational step in my coding journey.",
    "keyFeatures": [
      "Browse and search IMDB's top 1000 movies",
      "Built with vanilla JavaScript on Code.org",
      "Demonstrates fundamental data manipulation and UI skills"
    ],
    "techStack": "JavaScript, Code.org App Lab, HTML, CSS",
    "keywords": ["Web Development", "UI/UX & Design"],
    "outcomes": "Successfully created my first functional web application, solidifying core programming concepts and igniting my passion for front-end development.",
    "repoUrl": null,
    "demoUrl": "https://studio.code.org/projects/applab/w8PJdUtl1-DUKphmZ3zI9p0ZFzbPeqC5T_C0WHmYhVU",
    "images": ["imdb-top-1000-1"],
    "videoPreview": "/imdbtop1000demo.mp4",
    "startDate": "2023-09-01",
    "endDate": "2024-05-01",
    "type": "project",
    "theme": {
      "primary": "hsl(45, 93%, 54%)",
      "secondary": "hsl(0, 0%, 10%)"
    }
  },
  {
    "id": "album-tracks",
    "name": "Album Tracks",
    "tagline": "Original Tracks for Montages",
    "description": "This project is a collection of original music tracks I composed and produced using SoundTrap and GarageBand. These tracks were created specifically for montages on my <a href=\"https://www.youtube.com/@sunbeam20/\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"underline\">YouTube channel</a>. It was a journey into digital music production, exploring different beats, melodies, and moods to complement visual storytelling. Credit is required for any use of these tracks.",
    "keyFeatures": [
      "Original tracks composed in SoundTrap and GarageBand",
      "Designed for use in video montages",
      "Exploration of digital audio workstation (DAW) software",
      "Focus on creating atmospheric and rhythmic beats"
    ],
    "techStack": "SoundTrap, GarageBand, Digital Audio Production",
    "keywords": ["Creative Tech"],
    "outcomes": "Produced a small album of tracks, gaining hands-on experience with music composition, arrangement, and mixing. These songs enhanced the quality of my YouTube videos and served as a creative outlet for exploring audio engineering.",
    "repoUrl": null,
    "demoUrl": "https://drive.google.com/drive/folders/1DrceaX2DRv2ve6mYF7210ikESgcIUKOd",
    "images": ["album-tracks-1"],
    "videoPreview": "https://youtu.be/SWiwfNcLjWg",
    "startDate": "2022-03-01",
    "endDate": "2022-09-01",
    "type": "project",
    "theme": {
      "primary": "hsl(280, 80%, 60%)",
      "secondary": "hsl(50, 90%, 55%)"
    },
    "downloadableAudioFiles": [
      {
        "id": "edm-beats",
        "title": "EDM Beats",
        "file": "/edm-beats-voice.wav"
      },
      {
        "id": "piano-beats",
        "title": "Piano Beats",
        "file": "/piano-beats.wav"
      }
    ]
  }
]
