[
  {
    "id": "simplify-me",
    "name": "Simplify Me",
    "tagline": "Productivity-Boosting Application",
    "description": "Simplify Me is a comprehensive productivity application designed to streamline workflows and enhance user efficiency. It features a minimalist interface with powerful backend capabilities, focusing on task management, collaboration, and insightful analytics. The project was built from the ground up to solve common productivity hurdles.",
    "techStack": "Next.js, TypeScript, Tailwind CSS, Firebase, Node.js",
    "outcomes": "Achieved a 40% increase in user engagement within the first three months post-launch. The streamlined task management system reduced average task completion time by 25%. Recognized for its intuitive design and robust performance.",
    "repoUrl": "https://github.com/example/simplify-me",
    "demoUrl": "https://simplify-me-demo.com",
    "images": ["simplify-me-1", "simplify-me-2"],
    "theme": {
      "primary": "hsl(267, 95%, 48%)",
      "secondary": "hsl(14, 99%, 57%)"
    }
  },
  {
    "id": "vernato",
    "name": "Vernate",
    "tagline": "E-commerce Platform for Artisans",
    "description": "Vernate is a boutique e-commerce platform that empowers local artisans by providing them with a space to sell their creations. The platform supports multi-vendor stores, secure payments, and a beautiful, responsive storefront. The focus was on creating a user-friendly experience for both sellers and buyers.",
    "techStack": "React, Redux, Express, MongoDB, Stripe API",
    "outcomes": "Onboarded over 100 artisans in the first year. Processed over $50,000 in transactions with a 99.9% uptime. The platform was praised for its aesthetic and ease of use, leading to high seller retention.",
    "repoUrl": "https://github.com/example/vernato",
    "demoUrl": "https://vernato-demo.com",
    "images": ["vernato-1", "vernato-2"],
     "theme": {
      "primary": "hsl(196, 75%, 52%)",
      "secondary": "hsl(45, 100%, 55%)"
    }
  },
  {
    "id": "emty",
    "name": "EMTY",
    "tagline": "Data Visualization Dashboard",
    "description": "EMTY is an enterprise-level data visualization tool that transforms complex datasets into interactive and understandable dashboards. It connects to multiple data sources and provides real-time insights through a variety of customizable charts and graphs. The architecture is optimized for performance with large datasets.",
    "techStack": "Vue.js, D3.js, Python, Flask, PostgreSQL",
    "outcomes": "Enabled client to reduce data analysis time by 60%. Handled datasets with over 10 million rows with sub-second query responses. The tool became an integral part of the client's business intelligence workflow.",
    "repoUrl": "https://github.com/example/emty",
    "demoUrl": null,
    "images": ["emty-1"],
     "theme": {
      "primary": "hsl(210, 40%, 50%)",
      "secondary": "hsl(160, 60%, 45%)"
    }
  },
  {
    "id": "github-portfolio",
    "name": "GitHub Contributions",
    "tagline": "Open Source and Personal Projects",
    "description": "My GitHub profile is a testament to my passion for coding and continuous learning. It hosts a variety of projects, from small utility scripts to larger applications and contributions to open-source libraries. It showcases my proficiency in different languages and frameworks.",
    "techStack": "Git, GitHub Actions, Various Languages (JS, TS, Python)",
    "outcomes": "Actively maintained several open-source projects. Contributed to popular libraries, gaining experience in collaborative development workflows. My profile reflects a strong commitment to quality code and best practices.",
    "repoUrl": "https://github.com/example",
    "demoUrl": null,
    "images": ["github-1"],
     "theme": {
      "primary": "hsl(220, 13%, 18%)",
      "secondary": "hsl(220, 14%, 71%)"
    }
  }
]
